;********************************************************************************
; void read_sample_file()
;********************************************************************************
[BITS 16]
read_sample_file:
;**** スタックフレームの構築 **** 
                            ;    +2| IP (caller)
        push bp             ; BP  0| BP (old)
        mov bp, sp

;**** レジスタの保存 **** 

;**** ローカル変数 **** 
        cdecl memcpy16, SEARCH_RESULT, .s0, .s1 - .s0

;**** 処理の開始 ****

;**** レジスタの復帰 **** 

;**** スタックフレームの破棄 ****
        mov sp, bp
        pop bp
        ret

.s0:    db "File not found...               ", 0    ; 最大32文字の文字列バッファ
.s1:
