;********************************************************************************
; void int_pf()
;********************************************************************************
int_pf:
;**** スタックフレームの構築 **** 
                            ;      0| EIP (caller)
        pushf               ;     -4| EFLAGSの保存
        push cs             ;     -8| CSの保存
        push int_stop       ;    -12| EIP (スタック表示処理)

;**** レジスタの保存 **** 

;**** 処理の開始 ****
        mov eax, .s0

;**** レジスタの復帰 **** 

;**** スタックフレームの破棄 ****
        iret

.s0:    db " < PAGE FAULT > ", 0