 
        times (FAT1_OFFSET) - ($-$$)    db 0x0000   ; ファイルサイズ調整のための埋め草

;********************************************************************************
; FAT1領域 (先頭3クラスタだけ用意)
;********************************************************************************
FAT1:
        db 0xFF, 0xFF       ; クラスタ: 0
        db 0xFF, 0xFF       ; クラスタ: 1
        db 0xFF, 0xFF       ; クラスタ: 2

        times (FAT2_OFFSET) - ($-$$)    db 0x00     ; 残りのクラスタは0で埋める

;********************************************************************************
; FAT2領域 (先頭3クラスタだけ用意)
;********************************************************************************
FAT2:
        db 0xFF, 0xFF       ; クラスタ: 0
        db 0xFF, 0xFF       ; クラスタ: 1
        db 0xFF, 0xFF       ; クラスタ: 2

        times (FAT_ROOT_OFFSET) - ($-$$)    db 0x00 ; 残りのクラスタは0で埋める

;********************************************************************************
; ルートディレクトリ領域
;********************************************************************************
FAT_ROOT:
        db 'BOOTABLE', 'DSK'                        ; 0x00 (11) | ボリュームラベル
        db FAT_ATTR_ARCHIVE | FAT_ATTR_VOLUME_ID    ; 0x0B ( 1) | 属性
        db 0x00                                     ; 0x0C ( 1) | (Reserved)
        db 0x00                                     ; 0x0D ( 1) | TS (Tenth of Seconds)
        dw (0 << 11) | (0 << 5) | (0/2)             ; 0x0E ( 2) | 作成時刻 (00:00:00)
        dw (0 << 9) | (0 << 5) | ( 1)               ; 0x10 ( 2) | 作成日付 (1980/01/01)
        dw (0 << 9) | (0 << 5) | ( 1)               ; 0x12 ( 2) | アクセス日付 (1980/01/01)
        dw 0x0000                                   ; 0x14 ( 2) | (Reserved)
        dw (0 << 11) | (0 << 5) | (0/2)             ; 0x16 ( 2) | 更新時刻 (00:00:00)
        dw (0 << 9) | (0 << 5) | ( 1)               ; 0x18 ( 2) | 更新日付 (1980/01/01)
        dw 0                                        ; 0x1A ( 2) | 先頭クラスタ
        dd 0                                        ; 0x1C ( 4) | ファイルサイズ
FAT_FILE:
        db 'SPECIAL ', 'TXT'                        ; 0x00 (11) | ボリュームラベル
        db FAT_ATTR_ARCHIVE                         ; 0x0B ( 1) | 属性
        db 0x00                                     ; 0x0C ( 1) | (Reserved)
        db 0x00                                     ; 0x0D ( 1) | TS (Tenth of Seconds)
        dw (0 << 11) | (0 << 5) | (0/2)             ; 0x0E ( 2) | 作成時刻 (00:00:00)
        dw (0 << 9) | (0 << 5) | ( 1)               ; 0x10 ( 2) | 作成日付 (1980/01/01)
        dw (0 << 9) | (0 << 5) | ( 1)               ; 0x12 ( 2) | アクセス日付 (1980/01/01)
        dw 0x0000                                   ; 0x14 ( 2) | (Reserved)
        dw (0 << 11) | (0 << 5) | (0/2)             ; 0x16 ( 2) | 更新時刻 (00:00:00)
        dw (0 << 9) | (0 << 5) | ( 1)               ; 0x18 ( 2) | 更新日付 (1980/01/01)
        dw 2                                        ; 0x1A ( 2) | 先頭クラスタ
        dd DATA_FILE.end - DATA_FILE                ; 0x1C ( 4) | ファイルサイズ

        times (FAT_FILE_OFFSET) - ($-$$)    db 0x00

;********************************************************************************
; データ領域
;********************************************************************************
DATA_FILE:
        db 'Hello FAT!'
.end:
        db 0

ALIGN 512, db 0x00
        times (512 * 63) db 0x00                    ; ファイルサイズを320KBに調整


