;********************************************************************************
; int read_ring_buff(buff, out data)
;********************************************************************************
read_ring_buff:
;**** スタックフレームの構築 **** 
                            ;    +12| 読み込んだデータの格納先アドレス
                            ;     +8| リングバッファへのポインタ
                            ;     +4| EIP (caller)
        push ebp            ; EBP  0| EBP (old)
        mov ebp, esp

;**** レジスタの保存 **** 

;**** 処理の開始 ****
        mov eax, 0

;**** レジスタの復帰 **** 

;**** スタックフレームの破棄 ****
        mov esp, ebp
        pop ebp
        ret

;********************************************************************************
; int write_ring_buff(buff, data)
;********************************************************************************
write_ring_buff:
;**** スタックフレームの構築 **** 
                            ;    +12| 書き込むデータ
                            ;     +8| リングバッファへのポインタ
                            ;     +4| EIP (caller)
        push ebp            ; EBP  0| EBP (old)
        mov ebp, esp

;**** レジスタの保存 **** 

;**** 処理の開始 ****

;**** レジスタの復帰 **** 

;**** スタックフレームの破棄 ****
        mov esp, ebp
        pop ebp
        ret

;********************************************************************************
; void draw_key(col, row, buff)
;********************************************************************************
draw_key:
;**** スタックフレームの構築 **** 
                            ;    +16| 表示列
                            ;    +12| 表示行
                            ;     +8| リングバッファへのポインタ
                            ;     +4| EIP (caller)
        push ebp            ; EBP  0| EBP (old)
        mov ebp, esp

;**** レジスタの保存 **** 

;**** 処理の開始 ****

;**** レジスタの復帰 **** 

;**** スタックフレームの破棄 ****
        mov esp, ebp
        pop ebp
        ret
