;********************************************************************************
; void trap_gate_81()
;********************************************************************************
trap_gate_81:
;**** スタックフレームの構築 **** 
                            ;      0| EIP (caller)
;**** レジスタの保存 **** 

;**** 処理の開始 ****
        cli
        cdecl draw_char, ecx, edx, ebx, eax     ; 1文字出力する
        sti
;**** レジスタの復帰 **** 

;**** スタックフレームの破棄 ****
        iret

;********************************************************************************
; void trap_gate_82()
;********************************************************************************
trap_gate_82:
;**** スタックフレームの構築 **** 
                            ;      0| EIP (caller)
;**** レジスタの保存 **** 

;**** 処理の開始 ****
        cli
        cdecl draw_pixel, ecx, edx, ebx         ; 点を描画する
        sti
;**** レジスタの復帰 **** 

;**** スタックフレームの破棄 ****
        iret
